Revit 2024 API
ParameterTypeId.SteelElemHoleTapping Property
 "Right-handed thread"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemHoleTapping { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemHoleTapping As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemHoleTapping {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace